MikroElektronika/core_packages/ARM/gcc_clang/def/mindmotion/MM32F003NW/mcu.h
/**
******************************************************************************
* @file    MM32F003.h
* @brief   CMSIS Cortex-M3 Device Peripheral Access Layer Header File.
*          This file contains all the peripheral register's definitions, bits
*          definitions and memory mapping for MM32F003 High Density, Medium
*          Density and Low Density devices.
* @author  VV team
* @version V1.0.0
* @date    31/10/2017
******************************************************************************
*
* THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
* WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
* TIME. AS A RESULT, MindMotion SHALL NOT BE HELD LIABLE FOR ANY
* DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
* FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
* CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
*
* <h2><center>&copy; COPYRIGHT 2017 Mindmotion</center></h2>
******************************************************************************
*/

/** @addtogroup CMSIS
* @{
*/

/** @addtogroup MM32F003
* @{
*/

#ifndef __MM32F003_H
#define __MM32F003_H

/** @addtogroup Library_configuration_section
* @{
*/

#define MM32F003


#if !defined  USE_STDPERIPH_DRIVER
/**
* @brief Comment the line below if you will not use the peripherals drivers.
In this case, these drivers will not be included and the application code will
be based on direct access to peripherals registers
*/
/*#define USE_STDPERIPH_DRIVER*/
#endif

/**
* @brief In the following line adjust the value of External High Speed oscillator (HSE)
used in your application
*/
#define HSE_Value    ((uint32_t)8000000) /*!< Value of the External oscillator in Hz*/
#define HSE_VALUE    HSE_Value
/**
* @brief In the following line adjust the External High Speed oscillator (HSE) Startup
Timeout value
*/
#define HSEStartUp_TimeOut   ((uint16_t)0x0500) /*!< Time out for HSE start up */
#define HSE_STARTUP_TIMEOUT   HSEStartUp_TimeOut

#define HSI_Value    ((uint32_t)8000000) /*!< Value of the Internal oscillator in Hz*/
#define HSI_VALUE    HSI_Value

#define HSI_Value_Pll_OFF    ((uint32_t)48000000/6) /*!< Value of the Internal oscillator in Hz*/

#define HSI_VALUE_PLL_OFF   HSI_Value_Pll_OFF

/*!< [31:16] MM32F003 Standard Peripheral Library main version */
#define __MM32F003_STDPERIPH_VERSION_MAIN   (0x01)
/*!< [15:8]  MM32F003 Standard Peripheral Library sub1 version */
#define __MM32F003_STDPERIPH_VERSION_SUB1   (0x00)
/*!< [7:0]  MM32F003 Standard Peripheral Library sub2 version */
#define __MM32F003_STDPERIPH_VERSION_SUB2   (0x00)
/*!<MM32F003 Standard Peripheral Library version number */
#define __MM32F003_STDPERIPH_VERSION       ((__MM32F003_STDPERIPH_VERSION_MAIN << 16)\
| (__MM32F003_STDPERIPH_VERSION_SUB1 << 8)\
  | __MM32F003_STDPERIPH_VERSION_SUB2)

/**
* @}
*/

/** @addtogroup Configuration_section_for_CMSIS
* @{
*/

/**
* @brief Configuration of the Cortex-M3 Processor and Core Peripherals
*/
#define __MPU_PRESENT             0 /*!< MM32F003 does not provide a MPU present or not  */
#define __NVIC_PRIO_BITS          2 /*!< MM32F003 uses 2 Bits for the Priority Levels    */
#define __Vendor_SysTickConfig    0 /*!< Set to 1 if different SysTick Config is used */


/*!< Interrupt Number Definition */

typedef enum IRQn {
    /******  Cortex-M0 Processor Exceptions Numbers ****************************************************/
    NonMaskableInt_IRQn         = -14,    /*!< 2 Non Maskable Interrupt                                */
    HardFault_IRQn              = -13,    /*!< 3 Cortex-M0 Hard Fault Interrupt                        */
    MemoryManagement_IRQn       = -12,    /*!< 4 Cortex-M3 Memory Management Interrupt                 */
    BusFault_IRQn               = -11,    /*!< 5 Cortex-M3 Bus Fault Interrupt                         */
    UsageFault_IRQn             = -10,    /*!< 6 Cortex-M3 Usage Fault Interrupt                       */
    SVC_IRQn                    = -5,     /*!< 11 Cortex-M0 SV Call Interrupt                          */
    DebugMonitor_IRQn           = -4,     /*!< 12 Cortex-M3 Debug Monitor Interrupt                    */
    PendSV_IRQn                 = -2,     /*!< 14 Cortex-M0 Pend SV Interrupt                          */
    SysTick_IRQn                = -1,     /*!< 15 Cortex-M0 System Tick Interrupt                      */

    WWDG_IRQn                   = 0,      /*!< Window WatchDog Interrupt                               */
    PVD_IRQn                    = 1,      /*!< PVD through EXTI Line detect Interrupt                  */
    PWM_IRQn                    = 2,      /*!< Commutation and Input Interrupt                         */
    FLASH_IRQn                  = 3,      /*!< FLASH Interrupt                                         */
    RCC_IRQn                    = 4,      /*!< RCC Interrupt                                           */
    EXTI0_1_IRQn                = 5,      /*!< EXTI Line 0 and 1 Interrupts                            */
    EXTI2_3_IRQn                = 6,      /*!< EXTI Line 2 and 3 Interrupts                            */
    EXTI4_15_IRQn               = 7,      /*!< EXTI Line 4 to 15 Interrupts                            */
    HWDIV_IRQn                  = 8,      /*!< HWDIV Global Interuupt                                  */
    DMA_Channel1_IRQn           = 9,      /*!< DMA Channel 1 Interrupt                                 */
    DMA_Channel2_3_IRQn         = 10,     /*!< DMA Channel 2 and Channel 3 Interrupts                  */
    DMA_Channel4_5_IRQn         = 11,     /*!< DMA Channel 4 and Channel 5 Interrupts                  */
    ADC_COMP_IRQn               = 12,     /*!< ADC and COMP Global Interrupts                          */
    TIM1_BRK_UP_TRG_COM_IRQn    = 13,     /*!< TIM1 Break, Update, Trigger and Commutation Interrupts  */
    TIM1_CC_IRQn                = 14,     /*!< TIM1 Capture Compare Interrupt                          */
    TIM2_IRQn                   = 15,     /*!< TIM2 Interrupt                                          */
    TIM3_IRQn                   = 16,     /*!< TIM3 Interrupt                                          */
    TIM14_IRQn                  = 19,     /*!< TIM14 Interrupt                                         */
    TIM16_IRQn                  = 21,     /*!< TIM16 Interrupt                                         */
    TIM17_IRQn                  = 22,     /*!< TIM17 Interrupt                                         */
    I2C_IRQn                    = 23,     /*!< I2C Interrupt                                          */


    SPI_IRQn                    = 26,     /*!< SPI Interrupt                                          */

    UART_IRQn                   = 28,     /*!< UART Interrupt                                          */

} IRQn_Type;





/**
* @}
*/

#include "core_cm0.h"

#include <stdint.h>

