MikroElektronika/core_packages/ARM/gcc_clang/def/mindmotion/MM32F003NW/mcu.h
/** @addtogroup Exported_types
* @{
*/

/*!< MM32F003 Standard Peripheral Library old types (maintained for legacy prupose) */

typedef int32_t  s32;
typedef int16_t s16;
typedef int8_t  s8;

typedef const int32_t sc32;  /*!< Read Only */
typedef const int16_t sc16;  /*!< Read Only */
typedef const int8_t sc8;   /*!< Read Only */

typedef __IO int32_t  vs32;
typedef __IO int16_t  vs16;
typedef __IO int8_t   vs8;

typedef __I int32_t vsc32;  /*!< Read Only */
typedef __I int16_t vsc16;  /*!< Read Only */
typedef __I int8_t vsc8;   /*!< Read Only */

typedef uint32_t  u32;
typedef uint16_t u16;
typedef uint8_t  u8;

typedef const uint32_t uc32;  /*!< Read Only */
typedef const uint16_t uc16;  /*!< Read Only */
typedef const uint8_t uc8;   /*!< Read Only */

typedef __IO uint32_t  vu32;
typedef __IO uint16_t vu16;
typedef __IO uint8_t  vu8;

typedef __I uint32_t vuc32;  /*!< Read Only */
typedef __I uint16_t vuc16;  /*!< Read Only */
typedef __I uint8_t vuc8;   /*!< Read Only */

typedef enum {FALSE = 0, TRUE = !FALSE} bool;

typedef enum {RESET = 0, SET = !RESET} FlagStatus, ITStatus;

typedef enum {DISABLE = 0, ENABLE = !DISABLE} FunctionalState;
#define IS_FUNCTIONAL_STATE(STATE) (((STATE) == DISABLE) || ((STATE) == ENABLE))

typedef enum {ERROR = 0, SUCCESS = !ERROR} ErrorStatus;

#define SETnBIT(VALUE,BITs)   ((VALUE) |= (1<<BITs))
#define RSTnBIT(VALUE,BITs)   ((VALUE) &= ~(1<<BITs))




/**
* @}
*/

/** @addtogroup Peripheral_registers_structures
* @{
*/

/**
* @brief Analog to Digital Converter
*/

typedef struct {
    __IO uint32_t ADDATA;
    __IO uint32_t ADCFG;
    __IO uint32_t ADCR;
    __IO uint32_t ADCHS;
    __IO uint32_t ADCMPR;
    __IO uint32_t ADSTA;
    __IO uint32_t ADDR0;
    __IO uint32_t ADDR1;
    __IO uint32_t ADDR2;
    __IO uint32_t ADDR3;
    __IO uint32_t ADDR4;
    __IO uint32_t ADDR5;
    __IO uint32_t ADDR6;
    __IO uint32_t ADDR7;
    __IO uint32_t ADDR8;
    __IO uint32_t ADDR9;
    __IO uint32_t ADDR10;
    __IO uint32_t ADDR11;
    __IO uint32_t RESERVED0;
    __IO uint32_t ADDR13;
    __IO uint32_t ADDR14;
    __IO uint32_t ADDR15;
    __IO uint32_t ADC_ADSTA_EXT;
} ADC_TypeDef;


/**
* @brief CRC calculation unit
*/

typedef struct {
    __IO uint32_t DR;
    __IO uint8_t  IDR;
    uint8_t   RESERVED0;
    uint16_t  RESERVED1;
    __IO uint32_t CR;
} CRC_TypeDef;

/**
* @brief Debug MCU
*/

typedef struct {
    __IO uint32_t IDCODE;
    __IO uint32_t CR;
} DBGMCU_TypeDef;

/**
* @brief DMA Controller
*/

typedef struct {
    __IO uint32_t CCR;
    __IO uint32_t CNDTR;
    __IO uint32_t CPAR;
    __IO uint32_t CMAR;
} DMA_Channel_TypeDef;

typedef struct {
    __IO uint32_t ISR;
    __IO uint32_t IFCR;
} DMA_TypeDef;

/**
* @brief External Interrupt/Event Controller
*/

typedef struct {
    __IO uint32_t IMR;
    __IO uint32_t EMR;
    __IO uint32_t RTSR;
    __IO uint32_t FTSR;
    __IO uint32_t SWIER;
    __IO uint32_t PR;
} EXTI_TypeDef;

/**
* @brief FLASH Registers
*/

typedef struct {
    __IO uint32_t ACR;
    __IO uint32_t KEYR;
    __IO uint32_t OPTKEYR;
    __IO uint32_t SR;
    __IO uint32_t CR;
    __IO uint32_t AR;
    __IO uint32_t RESERVED;
    __IO uint32_t OBR;
    __IO uint32_t WRPR;
    __IO uint32_t RESERVED0;
    __IO uint32_t RESERVED1;
    __IO uint32_t RESERVED2;
    __IO uint32_t RESERVED3;
    __IO uint32_t RESERVED4;
    __IO uint32_t RESERVED5;
    __IO uint32_t RESERVED6;
    __IO uint32_t SECUKEY0R;
    __IO uint32_t SECUKEY1R;
    __IO uint32_t RESERVED7;
    __IO uint32_t RESERVED8;
    __IO uint32_t RESERVED9;

} FLASH_TypeDef;

/**
* @brief Option Bytes Registers
*/

typedef struct {
    __IO uint16_t RDP;
    __IO uint16_t USER;
    __IO uint16_t Data0;
    __IO uint16_t Data1;
    __IO uint16_t WRP0;
    __IO uint16_t WRP1;
    __IO uint16_t WRP2;
    __IO uint16_t WRP3;
} OB_TypeDef;


/**
* @brief General Purpose IO
*/

typedef struct {
    __IO uint32_t CRL;
    __IO uint32_t CRH;
    __IO uint32_t IDR;
    __IO uint32_t ODR;
    __IO uint32_t BSRR;
    __IO uint32_t BRR;
    __IO uint32_t LCKR;
    __IO uint32_t RESERVED0;
    __IO uint32_t AFRL;
    __IO uint32_t AFRH;
} GPIO_TypeDef;

/**
* @brief SysTem Configuration
*/

typedef struct {
    __IO uint32_t CFGR;       /*!< SYSCFG configuration register ,                           Address offset: 0x00 */
    __IO uint32_t RESERVED0;
    __IO uint32_t EXTICR[4];

} SYSCFG_TypeDef;

/**
* @brief Alternate Function IO
*/

/**
* @brief Inter-integrated Circuit Interface
*/

typedef struct {
    __IO uint16_t IC_CON;
    uint16_t  RESERVED0;
    __IO uint16_t IC_TAR;
    uint16_t  RESERVED1;
    __IO uint16_t IC_SAR;
    uint16_t  RESERVED2;

    uint16_t  RESERVED00;
    uint16_t  RESERVED3;
    __IO uint16_t IC_DATA_CMD;
    uint16_t  RESERVED4;
    __IO uint16_t IC_SS_SCL_HCNT;
    uint16_t  RESERVED5;
    __IO uint16_t IC_SS_SCL_LCNT;
    uint16_t  RESERVED6;
    __IO uint16_t IC_FS_SCL_HCNT;
    uint16_t  RESERVED7;
    __IO uint16_t IC_FS_SCL_LCNT;
    uint16_t  RESERVED8;

    uint16_t  RESERVED01;
    uint16_t  RESERVED9;

    uint16_t  RESERVED02;
    uint16_t  RESERVED10;
    __IO uint16_t IC_INTR_STAT;
    uint16_t  RESERVED11;
    __IO uint16_t IC_INTR_MASK;
    uint16_t  RESERVED12;
    __IO uint16_t IC_RAW_INTR_STAT;
    uint16_t  RESERVED13;
    __IO uint16_t IC_RX_TL;
    uint16_t  RESERVED14;
    __IO uint16_t IC_TX_TL;
    uint16_t  RESERVED15;
    __IO uint16_t IC_CLR_INTR;
    uint16_t  RESERVED16;
    __IO uint16_t IC_CLR_RX_UNDER;
    uint16_t  RESERVED17;
    __IO uint16_t IC_CLR_RX_OVER;
    uint16_t  RESERVED18;
    __IO uint16_t IC_CLR_TX_OVER;
    uint16_t  RESERVED19;
    __IO uint16_t IC_CLR_RD_REQ;
    uint16_t  RESERVED20;
    __IO uint16_t IC_CLR_TX_ABRT;
    uint16_t  RESERVED21;
    __IO uint16_t IC_CLR_RX_DONE;
    uint16_t  RESERVED22;
    __IO uint16_t IC_CLR_ACTIVITY;
    uint16_t  RESERVED23;
    __IO uint16_t IC_CLR_STOP_DET;
    uint16_t  RESERVED24;
    __IO uint16_t IC_CLR_START_DET;
    uint16_t  RESERVED25;
    __IO uint16_t IC_CLR_GEN_CALL;
    uint16_t  RESERVED26;
    __IO uint16_t IC_ENABLE;
    uint16_t  RESERVED27;

    __IO uint32_t IC_STATUS;
    __IO uint32_t IC_TXFLR;
    __IO uint32_t IC_RXFLR;
    __IO uint32_t IC_SDA_HOLD;

    uint32_t  RESERVED03;

    uint32_t  RESERVED04;
    __IO uint32_t IC_DMA_CR;

    uint32_t  RESERVED05;

