MikroElektronika/core_packages/ARM/gcc_clang/def/mindmotion/MM32F003NW/mcu.h
    uint32_t  RESERVED06;
    __IO uint32_t IC_SDA_SETUP;
    __IO uint32_t IC_ACK_GENERAL_CALL;


} I2C_TypeDef;

/**
* @brief Independent WATCHDOG
*/

typedef struct {
    __IO uint32_t KR;
    __IO uint32_t PR;
    __IO uint32_t RLR;
    __IO uint32_t SR;
} IWDG_TypeDef;

/**
* @brief Power Control
*/

typedef struct {
    __IO uint32_t CR;
    __IO uint32_t CSR;
} PWR_TypeDef;

/**
* @brief Reset and Clock Control
*/

typedef struct {
    __IO uint32_t CR;
    __IO uint32_t CFGR;
    __IO uint32_t CIR;
    __IO uint32_t APB2RSTR;
    __IO uint32_t APB1RSTR;
    __IO uint32_t AHBENR;
    __IO uint32_t APB2ENR;
    __IO uint32_t APB1ENR;
    __IO uint32_t RESERVED9;
    __IO uint32_t CSR;
    __IO uint32_t AHBRSTR;
    __IO uint32_t RESERVED0;
    __IO uint32_t RESERVED1;
    __IO uint32_t RESERVED2;
    __IO uint32_t RESERVED3;
    __IO uint32_t RESERVED4;
    __IO uint32_t RESERVED5;
    __IO uint32_t HSIDLY;
    __IO uint32_t HSEDLY;

} RCC_TypeDef;

/**
* @brief Serial Peripheral Interface
*/

#define SCSR    NSSR
#define EXTSCR  EXTCTL

typedef struct {
    __IO uint32_t TXREG;
    __IO uint32_t RXREG;
    __IO uint16_t CSTAT;
    uint16_t  RESERVED0;
    __IO uint16_t INTSTAT;
    uint16_t  RESERVED1;
    __IO uint16_t INTEN;
    uint16_t  RESERVED2;
    __IO uint16_t INTCLR;
    uint16_t  RESERVED3;
    __IO uint16_t GCTL;
    uint16_t  RESERVED4;
    __IO uint16_t CCTL;
    uint16_t  RESERVED5;
    __IO uint16_t SPBRG;
    uint16_t  RESERVED6;
    __IO uint16_t RXDNR;
    uint16_t  RESERVED7;
    __IO uint16_t SCSR;
    uint16_t  RESERVED8;
    __IO uint16_t EXTSCR;
    uint16_t  RESERVED9;
} SPI_TypeDef;

/**
* @brief TIM
*/

typedef struct {
    __IO uint32_t CR1;
//  uint16_t  RESERVED0;
    __IO uint32_t CR2;
//  uint16_t  RESERVED1;
    __IO uint32_t SMCR;
//  uint16_t  RESERVED2;
    __IO uint32_t DIER;
//  uint16_t  RESERVED3;
    __IO uint32_t SR;
//  uint16_t  RESERVED4;
    __IO uint32_t EGR;
//  uint16_t  RESERVED5;
    __IO uint32_t CCMR1;
//  uint16_t  RESERVED6;
    __IO uint32_t CCMR2;
//  uint16_t  RESERVED7;
    __IO uint32_t CCER;
//  uint16_t  RESERVED8;
    __IO uint32_t CNT;
//  uint16_t  RESERVED9;
    __IO uint32_t PSC;
//  uint16_t  RESERVED10;
    __IO uint32_t ARR;
//  uint16_t  RESERVED11;
    __IO uint32_t RCR;
//  uint16_t  RESERVED12;
    __IO uint32_t CCR1;
//  uint16_t  RESERVED13;
    __IO uint32_t CCR2;
//  uint16_t  RESERVED14;
    __IO uint32_t CCR3;
//  uint16_t  RESERVED15;
    __IO uint32_t CCR4;
//  uint16_t  RESERVED16;
    __IO uint32_t BDTR;
//  uint16_t  RESERVED17;
    __IO uint32_t DCR;
//  uint16_t  RESERVED18;
    __IO uint32_t DMAR;
//  uint16_t  RESERVED19;
//  __IO uint32_t OR;              /*!< TIM option register,                         Address offset: 0x50 */
    __IO uint32_t RESERVED0;
    __IO uint32_t CCMR3;
    __IO uint32_t CCR5;
//  uint16_t      RESERVED20;
} TIM_TypeDef;


/**
* @brief PWM Registers
*/

typedef struct {
    __IO uint32_t CSR;
    __IO uint32_t APMSKR;
    __IO uint32_t APMDLR;
} PWM_TypeDef;

/**
* @brief Universal Synchronous Asynchronous Receiver Transmitter
*/

typedef struct {
    __IO uint32_t TDR;
    __IO uint32_t RDR;
    __IO uint32_t CSR;
    __IO uint32_t ISR;
    __IO uint32_t IER;
    __IO uint32_t ICR;
    __IO uint32_t GCR;
    __IO uint32_t CCR;
    __IO uint32_t BRR;
    __IO uint32_t FRA;
    __IO uint32_t RXADD;
    __IO uint32_t RXMASK;
    __IO uint32_t SCR;
} UART_TypeDef;

/**
* @brief Window WATCHDOG
*/

typedef struct {
    __IO uint32_t CR;
    __IO uint32_t CFR;
    __IO uint32_t SR;
} WWDG_TypeDef;

/**
* @brief Divider
*/

typedef struct {
    __IO uint32_t DVD;
    __IO uint32_t DVS;
    __IO uint32_t QUOT;
    __IO uint32_t RMD;
    __IO uint32_t STATUS;
    __IO uint32_t DIVCON;
} DIVIDER_TypeDef;

/**
* @brief Root
*/
typedef struct {
    __IO uint32_t SQR;
    __IO uint32_t ROOT;
    __IO uint32_t CTRL;
} ROOT_TypeDef;

/**
* @brief Analog Comparators
*/

typedef struct {
    __IO uint32_t COMP_CSR;    /*!< Comparator control Status register, Address offset: 0x00 */
    __IO uint32_t RESERVED0;
    __IO uint32_t RESERVED1;
    __IO uint32_t RESERVED2;
    __IO uint32_t RESERVED3;
    __IO uint32_t RESERVED4;
    __IO uint32_t COMP_CRV;
    __IO uint32_t COMP_POLL;
} COMP_TypeDef;


/**
* @}
*/

/** @addtogroup Peripheral_memory_map
* @{
*/


#define OB_BASE               ((uint32_t)0x1FFFF800)    /*!< Flash Option Bytes base address */
#define SRAM_BASE             ((uint32_t)0x20000000) /*!< Peripheral base address in the bit-band region */
#define SRAM_BB_BASE          ((uint32_t)0x22000000) /*!< SRAM base address in the alias region */
#define PERIPH_BASE           ((uint32_t)0x40000000) /*!< SRAM base address in the bit-band region */
#define PERIPH_BB_BASE        ((uint32_t)0x42000000) /*!< Peripheral base address in the alias region */


/*!< Peripheral memory map */
#define APB1PERIPH_BASE       PERIPH_BASE
#define APBPERIPH_BASE        PERIPH_BASE
#define APB2PERIPH_BASE       (PERIPH_BASE + 0x10000)
#define AHBPERIPH_BASE        (PERIPH_BASE + 0x20000)


#define TIM2_BASE             (APB1PERIPH_BASE + 0x0000)
#define TIM3_BASE             (APB1PERIPH_BASE + 0x0400)

#define WWDG_BASE             (APB1PERIPH_BASE + 0x2C00)
#define IWDG_BASE             (APB1PERIPH_BASE + 0x3000)

#define SPI_BASE              (APB1PERIPH_BASE + 0x3800)

#define UART_BASE             (APB1PERIPH_BASE + 0x4400)

#define I2C_BASE              (APB1PERIPH_BASE + 0x5400)

#define PWR_BASE              (APB1PERIPH_BASE + 0x7000)



#define SYSCFG_BASE           (APB2PERIPH_BASE + 0x0000)
#define EXTI_BASE             (APB2PERIPH_BASE + 0x0400)

#define ADC_BASE              (APB2PERIPH_BASE + 0x2400)
#define TIM1_BASE             (APB2PERIPH_BASE + 0x2C00)
#define DBGMCU_BASE           (APB2PERIPH_BASE + 0x3400)
#define COMP_BASE             (APB2PERIPH_BASE + 0x3C00)
#define TIM14_BASE            (APB2PERIPH_BASE + 0x4000)
#define TIM16_BASE            (APB2PERIPH_BASE + 0x4400)
#define TIM17_BASE            (APB2PERIPH_BASE + 0x4800)

#define PWM_BASE              (APB2PERIPH_BASE + 0x6400)



